'''Напишіть програму, яка буде симулювати примітивне бото-спілкування.

Програма має зчитувати строку-звернення від користувача, після чого - шукати ключові слова в цьому зверненні та відповідати заготовленими фразами.

Реалізуйте наступні пари ключові слова => заготовлена фраза:

Привіт / Хай / Доброго дня => Доброго вечора, я бот з України!
Як справи? / Що робиш? / Чим займаєшся? => Вчусь програмувати на Python!
Фільм / Кінотеатр / Серіал => Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм ваша відповідь, він просто бомба!
Бувай / Надобраніч / Гудбай / До зустрічі => Побачимось у мережі, I'll be back.
Завершити виконання програми
Ключових слів не знайдено => Дуже цікаво, але, нажаль, нічого не зрозуміло :(
Якщо хочете, можете додати свої пари теж, або замінити існуючі, але має бути не менше 3 пар та одна з них - вихід з діалогу. Рекомендую поки не занурюватись занадто глибоко - через декілька занять ми зможемо зробити цього бота на більш цікавому рівні, тому не марнуйте час зараз.


Без циклу while буде важко підтримувати тривалу бото-розмову ;)

Приклад розмови:

Ви: хай)
Бот: Доброго вечора, я бот з України!
Ви: бот-бот, а чим займаєшся?
Бот: Вчусь програмувати на Python!
Ви: Ого, а я серіальчики дивлюсь...
Бот: Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал "Білий лотсс", він просто бомба!
Ви: ох нічого собі, якийсь бот, а серіал рекомендує
Бот: Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал "Білий лотсс", він просто бомба!
Ви: та добре тобі, бувай!
Бот: Побачимось у мережі, I'll be back.


Оцінювання
80/80 - з вашою бото-програмою цілком можна вести бото-розмову :)
10/10 - стійкість до некоректного вводу від користувача
5/5 - коментарі
5/5 - все вірно з точки зору ПЕП 8
+? - вдалий творчий підхід)'''

list1 = '''Привіт
Хай
Доброго дня!'''
list2 = '''Як справи?
Що робиш?
Чим займаєшся?'''
list3 = '''Фільм
Кінотеатр
Серіал'''
list4 = '''Бувай
Надобраніч
Гудбай
До зустрічі'''

bot_phrase1 = print('Привіт / Хай / Доброго дня!')
while True:
    user_phrase1 = input('Користувач:')
    if user_phrase1 in list1:
        print('Доброго вечора, я бот з України!!')
    elif user_phrase1 in list2:
        print('Вчусь програмувати на Python!')
    elif user_phrase1 in list3:
        print('Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал Гра пристолів, він просто бомба!')
    elif user_phrase1 in list4:
        print('Побачимось у мережі, бувай!!!')
        break
    else:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')