#  Написати програму що видаляє те що написано в дужках (), залишивши весь інший текст.

text = input("Введите текст: ")  # введення тексту користувачем
output = ""  # в цю змінну додається текст до та після дужок

while '(' in text and ')' in text:  # початок циклу, пошук дужок
    start_index = text.index('(')  # індекс дужки
    end_index = text.index(')')  # індекс другої дужки
    output += text[:start_index - 1]  # додавання тексту до дужки в змінну
    text = text[end_index + 1:]  # додавання тексту після дужки в змінну

output += text  # додавання тексту в змінну

print(output)  # вивід тексту без дужок
