# Написати програму, що зчитує числа від користувача поки не буде введено ключове слово sum.

numbers = []  # список для зберігання введених чисел
while True:  # початок циклу
    user_input = input("Введіть число або 'sum' для отримання суми: ")  # Користувач вводить числа
    if user_input.lower() == 'sum':  # умова циклу
        total = 0  # змінна для зберігання суми
        for j in numbers:
            total += j  # в змінну total додається змінна j
        print('Сума введених чисел: ', total)  # вивід суми чисел
        break  # завершення програми
    elif user_input.replace('-', '').replace('.', '').isdigit():  # перевірка на число та від'ємні та дробні числа
        j = float(user_input)  # перепризначення перемінної
        numbers.append(j)  # додавання значення перемінної в список
    else:
        print("Будь ласка, введіть число або 'sum' для отримання суми.")  # якщо не корректный ввід
