#  Написати програму, що зчитує числа від користувача поки не буде введено ключове слово sum.

summa = 0  # змінна суми чисел
while True:
    user_input = input("Введіть число або 'sum' для отримання суми: ")  # введення користувачем
    if user_input.lower() == "sum":  # якщо введено "sum", програма рахує суму та завершується
        print("Сума введених чисел:", summa)
        break
    elif user_input.replace('.', '').replace('-', '').isdigit():
        # Перевірка, чи є введене значення числом, включаючи від'ємні та дробові числа
        summa += float(user_input)  # додаємо введене число до змінної
    else:
        print("Помилка: введіть число або 'sum'.")  # Вивід помилки
