# Напишіть програму, яка буде симулювати примітивне бото-спілкування.

print("Привіт / Хай / Доброго дня!")  # Начальная фраза, что бы завязать общение
while True:
    user_input = input("Користувач: ")  # ввод пользователя
    #  поиск конкретного слова и перевод в нижний регистр для уменьшения ложных срабатываний и унификации ввода
    if "привіт" in user_input.lower() or "хай" in user_input.lower() or "доброго дня" in user_input.lower():
        print("Доброго вечора, я бот з України!")  # вывод фразы если слова совпали
    elif "як справи" in user_input.lower() or "що робиш" in user_input.lower() or "чим займаєшся" in user_input.lower():
        print("Вчусь програмувати на Python!")
    elif "фільм" in user_input.lower() or "кінотеатр" in user_input.lower() or "серіал" in user_input.lower():
        print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал Гра пристолів, він просто бомба!")
    elif "бувай" in user_input.lower() or "надобраніч" in user_input.lower() \
            or "гудбай" in user_input.lower() or "до зустрічі" in user_input.lower():
        print("Побачимось у мережі, бувай!")
        break  # прерывание цикла
    else:
        print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")  # вывод фразы если слова не совпали
