# Напишіть програму, яка буде симулювати примітивне бото-спілкування.

#  список слов "маркеров"
list1 = ''' 
Привіт
Хай
Доброго дня!'''
list2 = '''
Як справи?
Що робиш?
Чим займаєшся?'''
list3 = '''
Фільм
Кінотеатр
Серіал'''
list4 = '''
Бувай
Надобраніч
Гудбай
До зустрічі'''

print('Привіт / Хай / Доброго дня!')
while True:
    user_phrase1 = input('Користувач:')  # ввод пользователя
    if user_phrase1 in list1:  # если слово есть в списке выводит данную фразу
        print('Доброго вечора, я бот з України!!')
    elif user_phrase1 in list2:  # если слово есть в списке выводит данную фразу
        print('Вчусь програмувати на Python!')
    elif user_phrase1 in list3:  # если слово есть в списке выводит данную фразу
        print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал Гра пристолів, він просто бомба!")
    elif user_phrase1 in list4:  # если слово есть в списке выводит данную фразу и прерывает цикл
        print('Побачимось у мережі, бувай!!!')
        break  # прерывание цикла
    else:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')  # если слова нет в списках выводит данную фразу
